#იმუშავეთ ლოგიკურ ოპერაციებზე: print ბრძანებას გადაეცით 2 ან 3 ბულეანი და ისინი ერთმანეთთან დააკავშირეთ ლოგიკური ოპერატორებით (or / and)


print(5 > 10 and 30 > 20)

print( 5 < 10 and 30 < 20)

print( 10 > 30  or 10 == 10)



# 3) print ბრძანების გამოყენებით ჩამოწერეთ 10 ისეთი მაგალითი, სადაც გაერთიანებული გექნებათ შედარების ოპერაციები და ლოგიკური ოპერაციები. კარგი იქნება ცვლადებსაც თუ გამოიყენებთ და მათში შეინახავთ ბულეანებს ან სხვა მონაცემთა ტიპებს



print( 10 > 5 or 10+5 > 10)


print( 15 > 5 or 50+5 > 100)


print( 20 > 50 or 50 > 10)


print( 35 > 20 or 90 > 25)


print( 100 > 99 or 100 < 99)


print( 50 > 20 and  50 > 10)


print( 5 > 40 and  30 > 10)


print( 10 > 50 and  60 > 10)


print( 14 > 25 and  10 == 10)

print( 12 > 11 and   80 > 10)