# 2) თქვენი სიტყვებით ახსენით რა არის for ციკლი, საიტერაციო ცვლადი, კოდის ბლოკი, როგორ მუშაობს ისინი
# for ციკლი გამოიყენება მიმდევრობის განმეორებისთვის ის გამოიყენება for i in range კოდის საშუალებით.


# 3) შექმენით for ციკლი, რომელიც 10-დან 30-მდე რიცხვებს დაბეჭდავს
for i in range(10,30):
    print(i)

#  4) შექმენით for ციკლი, რომელიც 20-დან 40-ის ჩათვლით რიცხვებს დაბეჭდავს

for i in range(20,40):
    print(i)

# 5) შექმენით for ციკლი, რომელიც 50-დან 60-ის ჩათვლით ლუწ რიცხვებს დაბეჭდავს
for i in range(50,60):
    if i % 2 == 0:
        print(i)
# 6) შექმენით for ციკლი, რომელიც 10-დან 50-მდე კენტ რიცხვებს დაბეჭდავს
for i in range(10,50):
       if i % 2 != 0:
        print(i)

# 7) შექმენით for ციკლი, რომელიც 10-დან 20-მდე რიცხვების ჯამს დაბეჭდავს
sum = 0
for i in range(10,20):
    i += sum 
    print(i)

# ) შექმენით for ციკლი, რომელიც 2-დან 30-მდე ლუწი რიცხვების ჯამს დაბეჭდავს

sum = 0
for i in range(2,30):
    i += sum 
    print(i)
